import pandas as pd

# Матрица: Поставщики -> РЦ (транспортные затраты на 1 ед.)
cost_p_rc = pd.DataFrame({
    "РЦ1": [10, 50],
    "РЦ2": [50, 40],
    "РЦ3": [30, 15]
}, index=["П1", "П2"])

# Матрица: РЦ -> Магазины (транспортные затраты на 1 ед.)
cost_rc_m = pd.DataFrame({
    "М1": [2, 50, 35],
    "М2": [2, 50, 20],
    "М3": [50, 1, 10],
    "М4": [50, 1, 5]
}, index=["РЦ1", "РЦ2", "РЦ3"])

# Машины
vehicles = pd.DataFrame({
    "Вместимость": [15, 50],
    "Фикс_трата": [1500, 4000]
}, index=["Тип 1", "Тип 2"])

print("--- Матрица Поставщик -> РЦ ---")
print(cost_p_rc, "\n")
print("--- Матрица РЦ -> Магазин ---")
print(cost_rc_m, "\n")
print("--- Характеристики машин ---")
print(vehicles)